## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 35 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.dependencytrack_api_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_api_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 4096
                  + environment      = [
                      + {
                          + name  = "ALPINE_DATABASE_MODE"
                          + value = "external"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_URL"
                          + value = "${ALPINE_DATABASE_URL}"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER"
                          + value = "org.postgresql.Driver"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER_PATH"
                          + value = "/extlib/postgresql-42.2.5.jar"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_SIZE"
                          + value = "20"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MIN_IDLE"
                          + value = "10"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_IDLE_TIMEOUT"
                          + value = "300000"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_LIFETIME"
                          + value = "600000"
                        },
                    ]
                  + essential        = true
                  + image            = "dependencytrack/apiserver:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/data"
                          + readOnly      = false
                          + sourceVolume  = "${DEPENDENCYTRACK_SERVICE_NAME}"
                        },
                    ]
                  + name             = "${DEPENDENCYTRACK_SERVICE_NAME}"
                  + portMappings     = [
                      + {
                          + ContainerPort = 8080
                          + Protocol      = "tcp"
                          + hostPort      = 8080
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ALPINE_DATABASE_USERNAME"
                          + valueFrom = "${ALPINE_DATABASE_USERNAME}"
                        },
                      + {
                          + name      = "ALPINE_DATABASE_PASSWORD"
                          + valueFrom = "${ALPINE_DATABASE_PASSWORD}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "ALPINE_DATABASE_PASSWORD"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
          + "ALPINE_DATABASE_URL"          = (known after apply)
          + "ALPINE_DATABASE_USERNAME"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
          + "AWS_LOGS_GROUP"               = "/aws/ecs/dependencytrack_api"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "dependencytrack_api-task"
          + "DEPENDENCYTRACK_API_IMAGE"    = "dependencytrack/apiserver:4.4.2@sha256:584cfd2349ec93cfde2528b8f34bd5d3a9f0a393fa38806128d646743fa649ee"
          + "DEPENDENCYTRACK_SERVICE_NAME" = "dependencytrack_api"
        }
    }

  # aws_ecs_service.dependencytrack_api will be created
  + resource "aws_ecs_service" "dependencytrack_api" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/software_asset_tracking"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dependencytrack_api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "dependencytrack_api"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/dependencytrack-api/4b2a004160c7319f"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-09d3c49292459a4b0",
              + "sg-0ee09476a114968fc",
            ]
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.dependencytrack_frontend will be created
  + resource "aws_ecs_service" "dependencytrack_frontend" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/software_asset_tracking"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dependencytrack_frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_frontend:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "dependencytrack_frontend"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/dependencytrack-front-end/01eb838d0ad51578"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-09d3c49292459a4b0",
              + "sg-0ee09476a114968fc",
            ]
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.dependencytrack_api will be created
  + resource "aws_ecs_task_definition" "dependencytrack_api" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/dependencytrack_api_container_execution_role"
      + family                   = "dependencytrack_api"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/dependencytrack_execution_role"

      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-070d3c3d42b521764"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-098da7b1c87157226"
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # aws_efs_file_system_policy.dependencytrack will be created
  + resource "aws_efs_file_system_policy" "dependencytrack" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = "fs-070d3c3d42b521764"
      + id                                 = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "elasticfilesystem:ClientWrite",
                          + "elasticfilesystem:ClientMount",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "elasticfilesystem:AccessPointArn" = "arn:aws:elasticfilesystem:ca-central-1:794722365809:access-point/fsap-098da7b1c87157226"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-070d3c3d42b521764"
                      + Sid       = "AllowAccessThroughAccessPoint"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-070d3c3d42b521764"
                      + Sid       = "DenyNonSecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_efs_mount_target.dependencytrack[1] will be created
  + resource "aws_efs_mount_target" "dependencytrack" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-070d3c3d42b521764"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0ee09476a114968fc",
        ]
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.dependencytrack[2] will be created
  + resource "aws_efs_mount_target" "dependencytrack" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-070d3c3d42b521764"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0ee09476a114968fc",
        ]
      + subnet_id              = (known after apply)
    }

  # aws_iam_policy.dependencytrack_api_policies will be created
  + resource "aws_iam_policy" "dependencytrack_api_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "DependencytrackAPIContainerExecutionPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user",
                          + "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeMountTargets",
                          + "elasticfilesystem:ClientWrite",
                          + "elasticfilesystem:ClientMount",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-070d3c3d42b521764"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.dependencytrack_api_policies will be created
  + resource "aws_iam_role_policy_attachment" "dependencytrack_api_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dependencytrack_api_container_execution_role"
    }

  # aws_lb.dependencytrack will be created
  + resource "aws_lb" "dependencytrack" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = true
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "dependencytrack"
      + security_groups            = [
          + "sg-0ee09476a114968fc",
        ]
      + subnets                    = (known after apply)
      + tags                       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-794722365809"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.api will be created
  + resource "aws_lb_listener" "api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8081
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/dependencytrack-api/4b2a004160c7319f"
          + type             = "forward"
        }
    }

  # aws_lb_listener.frontend will be created
  + resource "aws_lb_listener" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/dependencytrack-front-end/01eb838d0ad51578"
          + type             = "forward"
        }
    }

  # aws_security_group.dependencytrack will be updated in-place
  ~ resource "aws_security_group" "dependencytrack" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                ]
              + description      = "Access to RDS Postgresql"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                ]
              + description      = "Allow EFS traffic into mount target from ECS"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                ]
              + description      = "Outbound access to dependency track api"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                ]
              + description      = "Outbound access to dependency track frontend"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 8081
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                ]
              - description      = "Access to RDS Postgresql"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                ]
              - description      = "Allow EFS traffic into mount target from ECS"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2049
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                ]
              - description      = "Outbound access to dependency track api"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                ]
              - description      = "Outbound access to dependency track frontend"
              - from_port        = 8081
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8081
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0ee09476a114968fc"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                  - "10.0.0.0/21",
                ]
              - description      = "Access to dependency track frontend"
              - from_port        = 8081
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8081
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                  - "10.0.0.0/21",
                ]
              - description      = "Access to services running on https"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                  - "10.0.0.0/21",
                ]
              - description      = "Inbound access to dependency track api"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                  + "10.0.0.0/21",
                ]
              + description      = "Access to dependency track frontend"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 8081
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                  + "10.0.0.0/21",
                ]
              + description      = "Access to services running on https"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                  + "10.0.0.0/21",
                ]
              + description      = "Inbound access to dependency track api"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "10.0.12.128/26",
                  + "10.0.12.192/26",
                  + "10.0.12.128/26",
                ]
              + description      = "Allow EFS traffic out from ECS to mount target"
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 2049
            },
          - {
              - cidr_blocks      = [
                  - "10.0.12.128/26",
                ]
              - description      = "Allow EFS traffic out from ECS to mount target"
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2049
            },
        ]
        name                   = "dependencytrack"
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.dependencytrack_db.aws_db_proxy.proxy will be created
  + resource "aws_db_proxy" "proxy" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "POSTGRESQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "dependency-track-proxy"
      + require_tls            = true
      + role_arn               = "arn:aws:iam::794722365809:role/dependency-track_rds_proxy"
      + tags                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-rds-proxy"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "security-tools-794722365809"
     ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
